package methods.typeByValue;

/**
 * Типы методов в зависимости от возвращаемого значения:
 * 1. Метод без возвращаемого значения (void)
 * 2. Метод с возвращаемым значением (есть return)
 * */
public class TypeMethodExample {

    public void method() {
        System.out.println("Это обычный метод");
    }

    /**
     * ‼️Здесь значение а = "Hello" существует только в рамках метода
     * и НЕ сохраняет изменения для переданного аргумента!
     * Как только метод закончится, значение а = "Hello" будет удалено из памяти.
     *
     * в Java параметры передаются «по значению» (pass-by-value), даже если это ссылки на объекты.
     * Когда вы вызываете метод и передаете в него переменную, Java не передает саму переменную.
     * Она создает её локальную копию.
     *
     * Для примитивов (int, double): копируется само число.
     * Для объектов (String, списки, классы): копируется ссылка (адрес в памяти), а не сам объект.
     *
     * Представьте, что вы дали другу не свой дом, а копию ключа от него.
     * Если друг зайдет в дом и переклеит обои (изменит состояние объекта) — вы это увидите, вернувшись домой.
     * Но если друг возьмет вашу копию ключа и обменяет её на ключ от другого дома
     * (переприсвоит ссылку a = "Hello"), ваш оригинальный ключ и ваш дом останутся при вас.
     * Вы просто потеряли связь с тем, что делает друг.
     * */
    public void method(String a) {
        System.out.println("Это метод с параметром");
        a = "Hello";
        System.out.println(a);
    }

    /**
     * Аналогично методу выше
     * */
    public void method(int a) {
        System.out.println("Это метод с параметром");
        a = 10;
        System.out.println(a);
    }

    public String method2() {
        System.out.println("Это метод с возвращаемым значением");
        return "Hello";
    }

    /**
     * ‼️Здесь значение а = "Hello" тоже существует только в рамках метода! Аналогично описанию выше.
     * НО! Значение а в a = example.method2(a) будет изменено, потому что мы ПЕРЕПРИСВОИЛИ ссылку.
     *
     * до: а = "string"
     *     | (а указывает на ячейку памяти, которая хранит string)
     * | string | | | | | | -> память
     *
     * после a = example.method2(a)
     *               \ (а указывает на ячейку памяти, которая хранит Hello)
     * | string | | | Hello | | | -> память
     * */
    public String method2(String a) {
        System.out.println("Это метод с возвращаемым значением и с параметром");
        a = "Hello";
        System.out.println(a);
        return a;
    }

    public int method2(int a) {
        System.out.println("Это метод с возвращаемым значением и с параметром");
        a = 10;
        System.out.println(a);
        return a;
    }
}
